public class HomeworkFirst {

    //1. Сделать метод, который выводит на экран сообщение "Я умею писать методы".
    //
    //2. Сделать метод, который принимает один параметр - целое число, и пишет на экран
    //"Делится на 2", если это число делится на 2. И пишет на экран "не делится на 2", если
    //оно не делится на 2
    //
    //3. Сделать метод, который принимает массив из целых чисел(!!!!) и в нем находит максимальное значение. Выводит его на экран
    //3.1. Сделать метод, который принимает массив из целых чисел(!!!!) и в нем находит среднее арифметическое
    // значение. Выводит его на экран

    public static void main(String[] args) {
        printMessage();
    }

    public static void printMessage() {
        System.out.println("Я умею писать методы");
    }


}
