public class Homework {

    //1. Создать класс "Язык программирования"
    //Добавьте поля: название языка, автор языка (или компания), дата первой версии языка
    //Создайте несколько языков программирования
    //Найдите среди них самых старый используя любой подход (стримы привествуются)

    //2. Создайте класс "посылка". Добавьте поля: город отправления и город получения, вес посылки, дата-время создания посылки
    // (посылки могут создаваться по всему миру,
    //очень много часовых поясов, нам важна не конкретная дата, а лишь какая посылка была создана ранее, чем другая)
    //Создать несколько посылок
    //Найти самую новую посылку среди тех, кто отправляется в Берлин

    //3. Создать класс Meeting (встреча), в класс добавьте поля: кто встречается, с кем встречается и дату-время встречи
    //Создайте несколько встреч
    //Найдите среднее время всех встреч.
    //Например, две встречи - одна встреча начинается 14-00, другая встреча начинается 16-00. Тогда среднее время начала встречи - 15-00
}
