public class MethodSecondExample {

    public static void main(String[] args) {
        printSum(200, 300);
        printNTimes(5);
    }

    public static void printSum(int a, int b) {
        System.out.println(a + b);
    }

    public static void printNTimes(int n) {
        for (int i = 0; i < n; i++) {
            System.out.println("Hello, world");
        }
    }


    //Нужно сделать каждое задание именно в методе!!!!!
    //1. сделать метод, который выводит на экран сообщение "Я имею писать методы"

    //2. сделать метод, который принимает один параметр - целое число, и пишет на экран
    //"Делится на 2", если оно делится на 2. И пишет на экран "не делится на 2", если
    //оно не делится на 2

    //3. Сделать метод, который принимает массив из целых чисел!!!! и в нем находит максимум.
    //3.1. Сделать метод, который принимает массив из целых чисел!!!! и в нем находит среднее значение.

}
