public class HomeworkTask {

    //Создайте класс "Машина"
    //у нее будет 3 поля: наименование марки, год выпуска и пробег

    //1. Среди машин, которые имеют год выпуска новее, чем 1999 необходимо подсчитать общий пробег
    //2. Среди машин, у которых пробег более 500 000 найти самую старую
    //3. Среди машин, у которых марка начинается на "V" или "W" найти с самым большим пробегом, но не более 200 000 тысяч


    //Создайте класс Person, у него будет три поля: имя, папа и мама. Папа и мама - тоже поля класса Person
    //4. У вас есть список из людей, найдите среди них всех мам и пап, у которых имя длиннее 6 букв

    //Либо Stream.of(), либо делаем по отдельности (способ Владимира)

    //Дополнение: важно поработать со стримами, но разрешается где-то какое-то действие выполнить без них


}
