public class Homework {

    //1.Пользователь вводит 10 чисел с консоли
    //Соберите их в массив и отсортируйте (любым способом, кроме заложенных в джава)
    //Бинарным поиском найдите число в этом массиве, которое пользователь введет 11ым
    //Вывести результат (индекс) на экран

    //Усложнения:
    //1. Вводится не 10 чисел, а строка содержащая числа, записанные через пробелы
    //2. Бинарный поиск обязательно должен быть реккурсивным

    //2. Пользователь вводит два числа - начальное и конечное число.
    // Выведите на экран все числа в этом промежутке, НО решить необходимо только с использование реккурсии




}
