<details>
  <summary style="cursor: pointer;"><b>English</b></summary>

### Program

**A program** is a set of commands that allow a computer to solve a problem and automate a business process. In this case, a person can write a program in a language understandable to humans (programming language). A computer can execute a program in a language that the computer understands (machine code, binary code). Therefore, the program must be converted from code written in a programming language to binary code.

It is important to remember that a program is **NOT an algorithm**, a program is an implementation of an algorithm in a specific programming language

### Programming languages

Let's look at examples and distinctive features of programming languages:

* Pascal, Basic - suitable for learning programming
* C/C++ - system software (operating systems, drivers, software for robots)
* Python - machine learning, data processing, application software (usually startups)
* PHP - websites
* JavaScript - most often used to implement browser logic in web applications
* C#/Java - universal programming languages, used to implement Enterprise/corporate systems (high loads, constant changes, complex business processes, large number of users)

### Computer architecture

The processor is the main "brains" of the computer, processing data and performing tasks. RAM is a fast but small memory that is used to temporarily store active data and programs. It depends on the power supply and is very important for the fast operation of the computer.
Permanent memory, such as a hard drive or SSD, provides slower but larger storage capacity than RAM. It is non-volatile and is used for long-term storage of files and operating systems.
All computer devices are controlled by the operating system, which provides interaction between the hardware and user programs, ensuring convenient and efficient use of the computer.

### Creating a Java Program

* Create a project as shown in class
* Create a class file and name it in the UpperCaseCamel format (all words together, each with a capital letter)
* Create an input starting point
* * write **psvm** inside the class and press Enter on the keyboard
* * The line **public static void main(String[] args)** should appear
* We write the code inside the curly braces of the starting point.
* * write **sout** and press Enter on the keyboard
* * The line **System.out.printLn();** should appear
* * We write any message between the brackets, it will be displayed on the screen. Don't forget to put the message in double quotes

</details>

<hr>

<details style="padding-top: 18px">
  <summary style="cursor: pointer;"><b>На русском</b></summary>


### Программа

**Программа** - это набор команд, позволяющих компьютеру решить какую-либо задачу и автоматизировать бизнес-процесс. При этом человек может написать программу на языке, понятном человеку (язык программирования). Компьютер же может выполнять программу на языке, понятном компьютеру (машинный, бинарный код). Следовательно, программа должна быть преобразована из кода, написанном на языке программирования, в бинарный код.

Важно помнить, что программа - это **НЕ алгоритм**, программа - это реализация алгоритма на конкретном языке программирования

### Языки программирования

Рассмотрим примеры и отличительные особенности языков программирования:

* Pascal, Basic - подходят для обучения программированию
* C/C++ - системное программное обеспечение (операционные системы, драйвера, ПО для роботов)
* Python - машинное обучение, обработка данных, прикладное ПО (как правило, стартапы)
* PHP - веб-сайты
* JavaScript - чаще всего используется для реализации браузерной логики в веб-приложениях
* C#/Java - универсальные языки программирования, используются для реализации Enterprise/корпоративных систем (высокие нагрузки, постоянные изменения, сложные бизнес-процессы, большое количество пользователей)

### Архитектура компьютера

Процессор является основным "мозгом" компьютера, обрабатывая данные и выполняя задачи. Оперативная память представляет собой быструю, но малую по объему память, которая используется для временного хранения активных данных и программ. Она зависит от энергоснабжения и очень важна для быстрой работы компьютера.
Постоянная память, например жесткий диск или SSD, предоставляет медленное по сравнению с оперативной памятью, но более вместительное хранилище данных. Она является энергонезависимой и используется для долгосрочного хранения файлов и операционных систем.
Всеми устройствами компьютера управляет операционная система, которая обеспечивает взаимодействие между аппаратным обеспечением и пользовательскими программами, обеспечивая удобное и эффективное использование компьютера.


Процессор является основным "мозгом" компьютера, обрабатывая данные и выполняя задачи. Оперативная память представляет собой быструю, но малую по объему память, которая используется для временного хранения активных данных и программ. Она зависит от энергоснабжения и очень важна для быстрой работы компьютера.
Постоянная память, например жесткий диск или SSD, предоставляет медленное по сравнению с оперативной памятью, но более вместительное хранилище данных. Она является энергонезависимой и используется для долгосрочного хранения файлов и операционных систем.
Всеми устройствами компьютера управляет операционная система, которая обеспечивает взаимодействие между аппаратным обеспечением и пользовательскими программами, обеспечивая удобное и эффективное использование компьютера.

### Создание программы на Java 

* Создаем проект, как было показано на занятии
* Создаем файл-класс и именуем его в формате UpperCaseCamel (все слова слитно, каждое с большой буквы)
* Создаем входную стартовую точку 
* * пишем **psvm** внутри класса и нажимаем Enter на клавиатуре
* * Должна появиться строчка **public static void main(String[] args)**
* Пишем внутри фигурных скобок стартовой точки код.
* * пишем **sout** и нажимаем на Enter на клавиатуре
* * Должна появиться строчка **System.out.printLn();**
* * Между скобок пишем любое сообщение, оно будет выведено на экран. Не забудьте взять сообщение в двойные кавычки

</details>
