public class Homework {

    //Сделать класс Человек
    //Добавить ему поля:

    //1. Имя
    //2. Возраст
    //3. Рост
    //4. Количество детей
    //5. Дата рождения (можно сделать строкой, но можно найти специальный тип для этого)

    //Добавить методы

    //1) Вывод Info по человеку
    //2) Расчет стажа человека (возраст - 18 лет)
    //3) Метод, в котором человек "здоровается"

    //Потренироваться
    //Создать несколько людей (заполнить их разными данными, повызывать методы)


    //Что мы делаем сейчас:
    //1. Конструктор, который заполняет все поля объекта
    //2. Создать пустой конструктор
    //3. Сделать свой любой произвольный конструктор (*)

    //Число 18 из метода по расчету стажа вынести как КОНСТАНТУ

    //Сделать класс-утилиту (на будущее, для последующих заданий)
    //2 статических метода
    //оба возвращают double
    //Один принимает 2 дробных числа, второй принимает 3 дробных числа
    //Оба метода считают среднее значение, один среди трех чисел, другой среди двух чисел


}
