public class ForExample {

    public static void main(String[] args) {
        //вывести числа от 0 до 1_000_000 (не включительно);

        //int i = 0;
        //while (i < 1_000_000) {
        //    System.out.println(i);
        //    i++;
        //}

        for (int i = 0; i < 1_000_000; i++) {
            System.out.println(i);
        }

        //psvm
        //sout
        //fori

        //5 раз написать привет

        for (int i = 0; i < 5; i++) {
            System.out.println("Привет");
        }

        for (int i = 0; i <= 1000; i += 2) {
            System.out.println(i);
        }

        for (int i = 0; i > 100; i++) {
            System.out.println("111111111111111111");
        }

        for (int i = 0; true; i++) {
            System.out.println(11111);
        }

        //Делаем только через while и do-while
        //1) Вывести на экран сообщение "Я знаю циклы" - 25 раз

        //2) Вывести числа от 0 до 1000, кратные 5

        //3) Вывести на экран все степени двойки от 1 до 100 000
        //1, 2, 4, 8=2*2*2, 16=2*2*2*2, 32, 64, 128, 256, 512, 1024, 2048

        //3.1) Все то же самое, что и в 3 задаче, но только те числа, которые заканчиваются на 8






    }
}
