public interface Swimmable {

    void swim();


    //Создаете класс "Подросток" (наследуется от Person)
    //1) В нем метод, который считает среднюю зарплату реализуете, так чтобы он всегда возвращал 0
    //1.1) (необязательный) добавить различные поля в класс Подросток

    //2) Сделать интерфейс "Доступный к работе", в нем один метод, который ничего не принимает и ничего не отдает
    // метод "Иди на работу"
    //2.1 реализуйте интерфейс у работника и у пенсионера
    //2.2 У работника в реализации метода напишите на экран "Я счастливо шагаю на работу"
    //2.3 В Пенсионере сделайте случайный выбор (Random) между вариантом "Я вообще-то на пенсии" и "Ладно, немного поработаю"


}
